
public class Exam_04 {
	public static void main(String[] args) {
		/*
		 * package 패키지명;
		 * import  패키지명;
		 * 
		 * 접근제한자 지정예약어  class 클래스명
		 * 				extends상위 클래스 implements 상위인터페이스
		 *		접근제한자 지정예약어 자료형 멤버필드;
		 *		접근제한자 지정예약어 반환형 멤버메소드(매개변수...){
		 *		}
		 *		접근제한자 생성자(){}
		 *		중첩클래스(내부클래스)
		 *
		 *클래스 : 구조체에 기능(메소드)을 넣어 만든 형태
		 *-> 선언(변수)(또는 멤머필드)부와 기능(메소드)(또는 멤머메소드)로 이뤄진 자료형
		 */
		/*
		 * 1.멤버필드와 멤버메소드
		 * 2.생성자(중요함)
		 * 3.접근제한자
		 * 4.지정예약어
		 * 5.중첩클래스
		 * 6.상속
		 * 7.다형성
		 * 8.추상화
		 * 9.인터페이스
		 * 
		 * 객체지향언어 4가지 속성
		 * -은닉화
		 * -상속성 (상속 - extends 상위클래스)
		 * -다형성
		 * -추상화
		 */
	}
}
//구조체 : 서로다른 자료형을 하나로 묶어서 사용 ->구조체는 개발자가 선언해준다.
//->새로운 자료형, 변수만 선언
